barefoot-example-metro-azure/src/test/resources/net/sf/barefoot/example/metro/azure/getMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="https://wsdl.example.barefoot.sf.net">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:getMessage/>
   </soapenv:Body>
</soapenv:Envelope>
